[{"ltl": ["Fy", "FGy"], "nlp": ["move to y", "stop at y", "visit y", "navigate to y", "Ensure you eventually reach location y.", "Guaranteed you will eventually visit y.", "Make sure you eventually get to y.", "You will eventually arrive at y.", "See to it that you finally navigate to y.", "It is required that you eventually go to y.", "You must eventually move to y.", "Don't fail to eventually reach y.", "Always reach y.", "Stay at y forever.", "Always visit y.", "Make sure you're always at y.", "Forever be in y.", "Continually be at y.", "Don't ever leave y.", "Always navigate to y.", "Continuously move to y.", "Always stop at y.", "Be at y consistently.", "Forever stop at y.", "Consistently visit y.", "Make y your constant location.", "Maintain presence at y.", "Ensure perpetual presence at y.", "Eventually, position yourself at y.", "After some time, get to location y.", "You must eventually localize at y.", "At some point, ensure your final destination is y.", "See that you eventually arrive at y.", "Ensure that y is your eventual destination.", "Make y your final position.", "Do not fail to eventually be at y.", "Reach y eventually.", "Maintain your location at y forever.", "Always be present at y.", "Stay put at y indefinitely.", "Never depart from y.", "Keep your location at y permanently.", "Be at y at all times.", "Remain at y without interruption.", "Never leave the vicinity of y.", "Always be at y continuously.", "Be sure to always localize at y.", "Always maintain your position at y.", "Forever guarantee your presence at y.", "Continuously maintain your position at y.", "Your location will always be y.", "Eventually, go to y.", "Guarantee that you eventually reach y.", "Make sure you eventually localize at y.", "You will eventually navigate to y.", "Ensure you eventually stop at y.", "Visit y at some point.", "After a while, reach y.", "Ensure you will eventually be at y.", "Make y your final destination.", "See to it that you eventually position yourself at y.", "You must always visit y.", "Forever be at y.", "Continually stay at y.", "Always maintain presence at y.", "Continuously localize at y.", "Always be in y.", "Forever navigate to y.", "Continuously stop at y.", "Make y your constant location.", "Maintain your location at y indefinitely.", "Always keep your position at y.", "Forever guarantee your presence at y.", "Consistently stay at y.", "Always be present at y.", "Never leave y."]}, {"ltl": ["F(y1&&Fy2)"], "nlp": ["move to y1 then to y2", "go to y1 before stopping at y2", "go to y2 by visiting y1 along the way", "go to y1 then go to y2", "go to y1 before going to y2", "Navigate to location y1, eventually reaching location y2.", "Reach y1, and subsequently, eventually, make your way to y2.", "First, go to y1; later, arrive at y2.", "Move towards y1, and after that, target y2.", "Head to y1; ultimately, get to y2.", "Your first destination is y1, with y2 being your eventual goal.", "Go to y1; then, your final objective is y2.", "Start at y1 and after that, arrive to y2.", "Travel to y1, and afterwards, go to y2.", "Begin moving to y1 and later visit y2.", "Proceed to y1, followed by a visit to y2.", "First, navigate to y1; then, ensure to be at y2.", "Move to y1; after this step, eventually reach y2.", "Your initial target is y1, and later y2 will be reached.", "Go to y1 and end at y2.", "Reach y1 and after that, eventually, go to y2.", "Visit y1 before visiting y2.", "Go to y1, eventually heading to y2.", "First get to y1 and then to y2.", "Move towards y1 and eventually reach y2.", "Go to y1 before eventually reaching y2.", "Reach y1, and then arrive at y2 eventually.", "Travel to y1, and eventually visit y2.", "Navigate to y1, then eventually move to y2.", "Go to y1, with y2 being your future destination.", "Head to y1, and later, ensure you are at y2.", "Move to y1, eventually targeting y2.", "Your initial move is to y1, followed by reaching y2.", "Start at y1 and eventually get to y2.", "Travel to y1, then finally arrive at y2.", "First, go to y1; eventually, your location should be y2.", "Move towards y1 and then ultimately arrive at y2.", "Go to y1 before you eventually get to y2.", "Reach y1, and then after that, go to y2.", "Visit y1, eventually ending up at y2.", "Go to y1; later, eventually reach y2.", "First, navigate to y1 and then arrive at y2.", "Move towards y1, and after, your final objective is y2.", "Head to y1, and eventually visit y2.", "Your first destination is y1, and eventually you must be at y2.", "Go to y1; then eventually, arrive to y2.", "Start moving to y1 before eventually reaching y2.", "Proceed to y1, and then your ultimate goal is y2.", "First go to y1 and then eventually head to y2.", "Move to y1; eventually, make your way to y2.", "Go to y1, and subsequently, target y2.", "Head to y1; finally, reach y2.", "Your first destination is y1, with y2 being your ultimate goal.", "Go to y1; then, y2 is your final objective.", "Start at y1 and eventually arrive at y2.", "Travel to y1, and afterwards, get to y2.", "Begin moving to y1 and eventually, visit y2.", "Proceed to y1, followed by a visit to y2.", "First, navigate to y1; then, ensure being at y2.", "Move to y1; after this step, eventually reach y2.", "Your initial target is y1, and later y2 will be reached.", "Go to y1 and end at y2.", "Reach y1 and then go to y2.", "Visit y1 before visiting y2.", "Go to y1, eventually heading to y2.", "First get to y1 and then to y2.", "Move towards y1 and eventually reach y2.", "Go to y1 before eventually reaching y2.", "Reach y1, and then arrive at y2 eventually.", "Travel to y1, and eventually visit y2.", "Navigate to y1, then eventually move to y2.", "Go to y1, with y2 being your future destination.", "Head to y1, and later, ensure you are at y2.", "Move to y1, eventually targeting y2.", "Your initial move is to y1, followed by reaching y2.", "Start at y1 and eventually get to y2.", "Travel to y1, then finally arrive at y2.", "First, go to y1; eventually, your location should be y2.", "Move towards y1 and then ultimately arrive at y2.", "Go to y1 before you eventually get to y2.", "Reach y1, and then after that, go to y2.", "Visit y1, eventually ending up at y2.", "Go to y1; later, eventually reach y2.", "First, navigate to y1 and then arrive at y2.", "Move towards y1, and after, your final objective is y2.", "Head to y1, and eventually visit y2.", "Your first destination is y1, and eventually you must be at y2.", "Go to y1; then eventually, arrive to y2.", "Start moving to y1 before eventually reaching y2.", "Proceed to y1, and then your ultimate goal is y2.", "First go to y1 and then eventually head to y2."]}, {"ltl": ["F(y1&&F(y2&&Fy3))"], "nlp": ["go to y1 then go to y2 and then go to y3", "Navigate to y1, subsequently reach y2, and eventually get to y3.", "First, move to y1. After that, go to y2, and finally, arrive at y3.", "Initiate by reaching y1, then proceed to y2, and conclude by visiting y3.", "Start at y1, then head to y2, and ultimately, find yourself at y3.", "Make your way to y1; afterwards, advance to y2 and then to y3.", "Begin at y1. After that, travel to y2 and then end up at y3.", "Go to y1 then make sure to reach y2, and then get to y3.", "Move to y1, then go to y2 and then make your way to y3.", "Firstly, get to y1; secondly, get to y2; and eventually, get to y3.", "Your first task: go to y1; your second task: go to y2; your final task: go to y3.", "Upon reaching y1, make sure to also get to y2, and then arrive at y3.", "First, go to y1. Then, get to y2 and then, get to y3.", "Head to y1; ensure you reach y2; then, get to y3.", "Firstly, reach y1, then, reach y2 and finally reach y3.", "Commence by navigating to y1, then to y2, and finally to y3.", "First traverse to y1, then to y2, and then make your way to y3.", "First, go to y1. Subsequently, go to y2, and eventually, reach y3.", "After getting to y1, make your way to y2, followed by y3.", "Upon arriving at y1, then head to y2, and subsequently, to y3.", "Reach y1, then continue to y2, and finally find y3.", "Go to y1, after that, ensure you also go to y2 and then visit y3.", "Start with y1, then move to y2, and finally, get to y3.", "First, locate y1; then proceed to y2, and after that, go to y3."]}, {"ltl": ["Fy1||Fy2", "F (y1 || y2)"], "nlp": ["go to y1 or go to y2", "visit y1 or visit y2", "eventually visit y1 or eventually visit y2", "Navigate to y1 or navigate to y2.", "Reach y1 or reach y2.", "Move to y1 or move to y2.", "Go to y1 or go to y2.", "Visit y1 or visit y2.", "Eventually visit y1 or eventually visit y2.", "Eventually go to y1 or eventually go to y2.", "Eventually move to y1 or eventually move to y2.", "You must visit y1 or you must visit y2.", "You must reach y1 or you must reach y2.", "Make your way to y1 or make your way to y2.", "Head to y1 or head to y2.", "You are required to be at y1 or you are required to be at y2.", "The task involves visiting y1 or visiting y2.", "The task involves reaching y1 or reaching y2.", "You will eventually be at y1 or you will eventually be at y2.", "You will eventually arrive at y1 or you will eventually arrive at y2.", "Your destination is either y1 or y2.", "Your final location will be y1 or y2.", "Proceed to y1 or proceed to y2.", "Initiate travel to y1 or initiate travel to y2.", "Commence the journey to y1 or commence the journey to y2.", "Complete the path to y1 or complete the path to y2.", "After some time, be at y1 or be at y2."]}, {"ltl": ["F(y3&&F(y1||y2))"], "nlp": ["go to y3 and then  visit y1 or y2", "Navigate to y3 and eventually reach y1 or y2.", "Proceed to y3 and finally arrive at y1 or y2.", "Move to y3 and ultimately get to y1 or y2.", "Travel to y3 and then make your way to y1 or y2.", "Head to y3 and then find y1 or y2.", "Go to y3 and afterwards, access either y1 or y2.", "Reach y3, and subsequently, either visit y1 or y2.", "First, get to y3, then, at some point, be at y1 or y2.", "After arriving at y3, ensure you visit y1 or y2.", "After reaching y3, go to y1 or y2.", "Once at y3, find y1 or y2.", "On your way to y3, keep in mind you need to visit y1 or y2.", "After reaching y3, find y1 or y2.", "Drive to y3 then visit y1 or y2.", "Go to location y3 and then visit either location y1 or y2.", "Make your way to y3, and later, go to y1 or y2.", "First move to y3, then eventually visit y1 or y2.", "Begin at y3, and later, visit y1 or y2.", "Navigate to y3, and then, at some point, be in y1 or y2.", "Go to y3 and then, later, find yourself at y1 or y2.", "Travel to y3 and then get to y1 or y2.", "Move towards y3 and later visit y1 or y2.", "From y3, you must visit y1 or y2 at some point."]}]